In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df1 = pd.read_csv("p1_numeric.csv", sep=',')
df1.sort_values(by = 'cust')

       Unnamed: 0        cust  ma_fem_dv  ages  zon_hlv
0               0  M000034966          0     2        7
1               1  M000059535          0     1       12
2               2  M000136117          0     1       11
3               3  M000201112          0     3       17
4               4  M000225114          0     2       17
...           ...         ...        ...   ...      ...
29908       29908  M999708287          0     2       10
29909       29909  M999770689          0     1       16
29910       29910  M999849895          0     0        4
29911       29911  M999926092          1     1        8
29912       29912  M999962961          0     3       17

[29913 rows x 5 columns]

In [3]:
df1.isnull().sum()

Unnamed: 0    0
cust          0
ma_fem_dv     0
ages          0
zon_hlv       0
dtype: int64

In [4]:
print(df1.groupby('ma_fem_dv').size())

ma_fem_dv
0    20083
1     9830
dtype: int64

In [5]:
print(df1.groupby(df1['ages']).size())

ages
0    3853
1    7736
2    9863
3    5633
4    2115
5     713
dtype: int64

In [6]:
print('지역 대분류')
print(df1.groupby(df1['zon_hlv']).size())

지역 대분류
zon_hlv
1      474
2      103
3      600
4     1750
5      576
6     1080
7      204
8      739
9      642
10    8157
11    1840
12     803
13     896
14     988
15     677
16    2503
17    7881
dtype: int64

In [7]:
df1.groupby('zon_hlv')['ages'].agg(**{'most_common_value':lambda x:x.mode()}).reset_index()

    zon_hlv  most_common_value
0         1                  2
1         2                  2
2         3                  2
3         4                  2
4         5                  2
5         6                  2
6         7                  2
7         8                  2
8         9                  2
9        10                  2
10       11                  2
11       12                  2
12       13                  2
13       14                  2
14       15                  2
15       16                  2
16       17                  2